app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows` FROM `datos_usuarios`
SELECT COUNT(*) AS `numrows` FROM `clases`
SELECT COUNT(*) AS `numrows` FROM `reservas`
---
    public function dashboard_admin()
    {
        $usuarioModel = new DatosUsuarioModel();
        $claseModel = new ClaseModel();
        $reservaModel = new ReservaModel();

        $data = [
            'usuarios' => $usuarioModel->countAll(),
            'clases'   => $claseModel->countAll(),
            'reservas' => $reservaModel->countAll(),
        ];