app/Controllers/Usuario.php

    public function dashboard_usuario()
    {
    if(!session()->has('id_usuario') || session('id_rol') != 3){
        return redirect()->to('/login');
    }

    // ⚙️ Obtener ID del usuario desde la sesión
    $idUsuario = session('id_usuario');

    // 📊 Cargar modelos
    $usuarioModel = new DatosUsuarioModel();
    $reservaModel = new ReservaModel();

    // 📌 Obtener datos del usuario y sus clases
    $usuario = $usuarioModel->find($idUsuario);
---
SELECT *
FROM `datos_usuarios`
WHERE `datos_usuarios`.`id_usuario` = 1