app/Models/PerfilModel.php

 public function login($usuario, $password)
{
    $data = $this->where('nombre_usuario', $usuario)->first();
---
SELECT *
FROM `perfil`
WHERE `nombre_usuario` = 'pruebausuario'
 LIMIT 1